class Class_nodes:
    def __init__(self, i):
        self.id = i  # id узла
        # -------------------------------------------------
        # 1ый элемент массива - 1 шаг по времени назад
        # 2ый элемент массива - текущий шаг по времени
        # 3ый элемент массива - следующий шаг по времени
        self.u = [0, 0, 0]  # перемещение узла
        self.q = [0, 0, 0]  # поворот узла
        self.du = [0, 0, 0]  # скорость узла
        self.dq = [0, 0, 0]  # угловая скорость узла
        self.ddu = [0, 0, 0]  # ускорение узла
        self.ddq = [0, 0, 0]  # угловое ускорение узла
        # -------------------------------------------------

    # def calc_vel(self, dt):  # считаем скорость узла
    #     self.du = (self.u - self.u1) / dt
    #     self.dq = (self.q - self.q1) / dt
    #
    # def calc_acc(self, dt):  # считаем ускорение узла
    #     self.ddu = (self.u - 2 * self.u1 + self.u2) / dt**2
    #     self.ddq = (self.q - 2 * self.q1 + self.q2) / dt**2
